Autodesk.Revit.DB.IFC.IFCImportOptions.LinkPosition
The position of the Linked IFC File in the Host Document.
Remarks:
Link Orientation only applies during a Link IFC operation.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.IFC.IFCImportOptions.LinkOrientation
The orientation of the Linked IFC File in the Host Document.
Remarks:
Link Orientation only applies during a Link IFC operation.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2026